-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Anamakine: 127.0.0.1
-- Üretim Zamanı: 10 Şub 2026, 16:02:01
-- Sunucu sürümü: 10.4.32-MariaDB
-- PHP Sürümü: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Veritabanı: `slot_db`
--

-- --------------------------------------------------------

--
-- Tablo için tablo yapısı `machines`
--

CREATE TABLE `machines` (
  `id` int(11) NOT NULL,
  `room` varchar(64) NOT NULL,
  `machine_number` varchar(64) NOT NULL,
  `brand_model` varchar(128) NOT NULL,
  `maintenance_date` date NOT NULL,
  `note` text DEFAULT NULL,
  `x` int(11) NOT NULL DEFAULT 30,
  `y` int(11) NOT NULL DEFAULT 30,
  `size` int(11) NOT NULL DEFAULT 63,
  `rotation` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Tablo döküm verisi `machines`
--

INSERT INTO `machines` (`id`, `room`, `machine_number`, `brand_model`, `maintenance_date`, `note`, `x`, `y`, `size`, `rotation`, `created_at`, `updated_at`) VALUES
(1, 'YENİ VİP SALON', '2192', 'EGT', '2026-02-08', '', 21, 472, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:55'),
(2, 'YENİ VİP SALON', '2194', 'EGT', '2026-02-08', '', 21, 409, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:55'),
(3, 'YENİ VİP SALON', '2635', 'EGT', '2026-02-08', '', 21, 346, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:55'),
(4, 'YENİ VİP SALON', '2770', 'EGT', '2026-02-08', '', 21, 283, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:55'),
(5, 'YENİ VİP SALON', '2361', 'EGT', '2026-02-08', '', 210, 283, 63, 90, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(6, 'YENİ VİP SALON', '2362', 'EGT', '2026-02-08', '', 210, 346, 63, 90, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(7, 'YENİ VİP SALON', '2363', 'EGT', '2026-02-08', '', 210, 409, 63, 90, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(8, 'YENİ VİP SALON', '2364', 'EGT', '2026-02-08', '', 210, 472, 63, 90, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(9, 'YENİ VİP SALON', '2257', 'EGT', '2026-02-08', '', 273, 472, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(10, 'YENİ VİP SALON', '2258', 'EGT', '2026-02-08', '', 273, 409, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(11, 'YENİ VİP SALON', '2259', 'EGT', '2026-02-08', '', 273, 346, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(12, 'YENİ VİP SALON', '2260', 'EGT', '2026-02-08', '', 273, 283, 63, 270, '2026-02-08 19:42:50', '2026-02-08 20:52:33'),
(13, 'YENİ VİP SALON', '3072', 'XTENSİON LİNK', '2026-02-08', '', 532, 469, 63, 270, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(14, 'YENİ VİP SALON', '3073', 'XTENSİON LİNK', '2026-02-08', '', 532, 406, 63, 270, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(15, 'YENİ VİP SALON', '3074', 'XTENSİON LİNK', '2026-02-08', '', 532, 343, 63, 270, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(16, 'YENİ VİP SALON', '3075', 'XTENSİON LİNK', '2026-02-08', '', 532, 280, 63, 270, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(17, 'YENİ VİP SALON', '3076', 'XTENSİON LİNK', '2026-02-08', '', 469, 280, 63, 90, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(18, 'YENİ VİP SALON', '3077', 'XTENSİON LİNK', '2026-02-08', '', 469, 343, 63, 90, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(19, 'YENİ VİP SALON', '3078', 'XTENSİON LİNK', '2026-02-08', '', 469, 406, 63, 90, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(20, 'YENİ VİP SALON', '3079', 'XTENSİON LİNK', '2026-02-08', '', 469, 469, 63, 90, '2026-02-08 19:42:50', '2026-02-09 16:36:34'),
(21, 'YENİ VİP SALON', '2946', 'VİP EGT', '2026-02-08', '', 724, 494, 63, 270, '2026-02-08 19:42:50', '2026-02-09 13:51:16'),
(22, 'YENİ VİP SALON', '2947', 'VİP EGT', '2026-02-08', '', 724, 431, 63, 270, '2026-02-08 19:42:50', '2026-02-09 13:51:16'),
(23, 'YENİ VİP SALON', '2738', 'VİP EGT', '2026-02-08', '', 724, 368, 63, 270, '2026-02-08 19:42:50', '2026-02-09 13:51:16'),
(24, 'YENİ VİP SALON', '2948', 'VİP EGT', '2026-02-08', '', 724, 305, 63, 270, '2026-02-08 19:42:50', '2026-02-09 13:51:16'),
(25, 'YENİ VİP SALON', '2949', 'VİP EGT', '2026-02-08', '', 724, 242, 63, 270, '2026-02-08 19:42:50', '2026-02-09 13:51:16'),
(26, 'YENİ VİP SALON', '2443', 'VİP EGT', '2026-01-14', '', 864, 45, 63, 0, '2026-02-08 19:42:50', '2026-02-10 13:39:08'),
(27, 'YENİ VİP SALON', '2604', 'VİP EGT', '2026-02-09', '', 927, 45, 63, 0, '2026-02-08 19:42:50', '2026-02-09 13:52:11'),
(28, 'YENİ VİP SALON', '2607', 'VİP EGT', '2026-02-08', '', 990, 45, 63, 0, '2026-02-08 19:42:50', '2026-02-09 21:03:30'),
(29, 'YENİ VİP SALON', '2722', 'VİP EGT', '2026-02-08', '', 1053, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(30, 'YENİ VİP SALON', '2723', 'VİP EGT', '2026-02-08', '', 1116, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(31, 'YENİ VİP SALON', '2724', 'VİP EGT', '2026-02-08', '', 1179, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(32, 'YENİ VİP SALON', '2725', 'VİP EGT', '2026-02-08', '', 1242, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(33, 'YENİ VİP SALON', '2726', 'VİP EGT', '2026-02-08', '', 1305, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(34, 'YENİ VİP SALON', '2727', 'VİP EGT', '2026-02-08', '', 1368, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(35, 'YENİ VİP SALON', '2728', 'VİP EGT', '2026-02-08', '', 1431, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(36, 'YENİ VİP SALON', '2729', 'VİP EGT', '2026-02-08', '', 1494, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(37, 'YENİ VİP SALON', '2730', 'VİP EGT', '2026-02-08', '', 1557, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(38, 'YENİ VİP SALON', '2731', 'VİP EGT', '2026-02-08', '', 1620, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(39, 'YENİ VİP SALON', '2732', 'VİP EGT', '2026-02-08', '', 1683, 46, 63, 0, '2026-02-08 19:42:50', '2026-02-08 20:56:22'),
(40, 'YENİ VİP SALON', '2969', 'VİP EGT', '2026-01-01', '', 1847, 96, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(41, 'YENİ VİP SALON', '2970', 'VİP EGT', '2026-01-01', '', 1847, 159, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(42, 'YENİ VİP SALON', '2971', 'VİP EGT', '2026-01-01', '', 1847, 222, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(43, 'YENİ VİP SALON', '3037', 'VİP EGT', '2026-01-01', '', 1847, 285, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(44, 'YENİ VİP SALON', '3038', 'VİP EGT', '2026-01-01', '', 1847, 348, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(45, 'YENİ VİP SALON', '3051', 'VİP EGT', '2026-01-01', '', 1847, 411, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(46, 'YENİ VİP SALON', '3052', 'VİP EGT', '2026-01-01', '', 1847, 474, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(47, 'YENİ VİP SALON', '3053', 'VİP EGT', '2026-01-01', '', 1847, 537, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(48, 'YENİ VİP SALON', '3054', 'VİP EGT', '2026-01-01', '', 1847, 600, 63, 90, '2026-02-08 19:42:50', '2026-02-08 21:03:39'),
(49, 'YENİ VİP SALON', '3055', 'VİP EGT', '2026-02-08', '', 1587, 631, 63, 180, '2026-02-08 19:42:50', '2026-02-08 20:58:13'),
(50, 'YENİ VİP SALON', '3056', 'VİP EGT', '2026-02-08', '', 1524, 631, 63, 180, '2026-02-08 19:42:50', '2026-02-08 20:58:15');

--
-- Dökümü yapılmış tablolar için indeksler
--

--
-- Tablo için indeksler `machines`
--
ALTER TABLE `machines`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `machine_number` (`machine_number`),
  ADD KEY `idx_room` (`room`),
  ADD KEY `idx_machine_number` (`machine_number`),
  ADD KEY `idx_maintenance_date` (`maintenance_date`);

--
-- Dökümü yapılmış tablolar için AUTO_INCREMENT değeri
--

--
-- Tablo için AUTO_INCREMENT değeri `machines`
--
ALTER TABLE `machines`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
